# Data Processing

In [46]:
import pandas

df0 = pandas.read_csv("./data/daily_sales_data_0.csv")

df0.head()

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

In [47]:
df0 = df0[df0['product'].str.contains('pink morsel')==True]

In [48]:
df0.head()

        product  price  quantity        date region
0   pink morsel  $3.00       546  2018-02-06  north
1   pink morsel  $3.00       549  2018-02-06  south
2   pink morsel  $3.00       577  2018-02-06   east
3   pink morsel  $3.00       519  2018-02-06   west
28  pink morsel  $3.00       529  2018-02-07  north

In [49]:
df0['price'] = df0['price'].str.replace('$', '')

df0.head()

C:\Users\hamza\AppData\Local\Temp\ipykernel_6608\4231392804.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df0['price'] = df0['price'].str.replace('$', '')

        product price  quantity        date region
0   pink morsel  3.00       546  2018-02-06  north
1   pink morsel  3.00       549  2018-02-06  south
2   pink morsel  3.00       577  2018-02-06   east
3   pink morsel  3.00       519  2018-02-06   west
28  pink morsel  3.00       529  2018-02-07  north

In [50]:
df0.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1960 entries, 0 to 13695
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   1960 non-null   object
 1   price     1960 non-null   object
 2   quantity  1960 non-null   int64
 3   date      1960 non-null   object
 4   region    1960 non-null   object
dtypes: int64(1), object(4)
memory usage: 91.9+ KB

In [51]:
df0['price'] = df0['price'].astype(float)

In [52]:
df0['sales'] = df0['price'] * df0['quantity']

In [53]:
df0.head()

        product  price  quantity        date region   sales
0   pink morsel    3.0       546  2018-02-06  north  1638.0
1   pink morsel    3.0       549  2018-02-06  south  1647.0
2   pink morsel    3.0       577  2018-02-06   east  1731.0
3   pink morsel    3.0       519  2018-02-06   west  1557.0
28  pink morsel    3.0       529  2018-02-07  north  1587.0

In [54]:
cols = ['sales','date','region']

df0 = df0[cols]

In [34]:
df0.head()

     sales        date region
0   1638.0  2018-02-06  north
1   1647.0  2018-02-06  south
2   1731.0  2018-02-06   east
3   1557.0  2018-02-06   west
28  1587.0  2018-02-07  north

In [ ]:
df0.to_csv(r'./data/processedDF0', index = False)

---

In [2]:
import pandas

df1 = pandas.read_csv("./data/daily_sales_data_1.csv")

df1.head()

       product  price  quantity        date region
0  pink morsel  $3.00       545  2019-06-11  north
1  pink morsel  $3.00       521  2019-06-11  south
2  pink morsel  $3.00       595  2019-06-11   east
3  pink morsel  $3.00       507  2019-06-11   west
4  gold morsel  $9.99       529  2019-06-11  north

In [36]:
df1 = df1[df1['product'].str.contains('pink morsel')==True]
df1['price'] = df1['price'].str.replace('$', '')
df1['price'] = df1['price'].astype(float)
df1['sales'] = df1['price'] * df1['quantity']
cols = ['sales','date','region']

df1 = df1[cols]

C:\Users\hamza\AppData\Local\Temp\ipykernel_6608\1661203868.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df1['price'] = df1['price'].str.replace('$', '')

In [37]:
df1.head()

     sales        date region
0   1635.0  2019-06-11  north
1   1563.0  2019-06-11  south
2   1785.0  2019-06-11   east
3   1521.0  2019-06-11   west
28  1728.0  2019-06-12  north

In [38]:
df1.to_csv(r'./data/processedDF1', index = False)

---

In [3]:
import pandas

df2 = pandas.read_csv("./data/daily_sales_data_2.csv")

df2.head()

       product  price  quantity        date region
0  pink morsel  $3.00       526  2020-10-13  north
1  pink morsel  $3.00       546  2020-10-13  south
2  pink morsel  $3.00       505  2020-10-13   east
3  pink morsel  $3.00       561  2020-10-13   west
4  gold morsel  $9.99       553  2020-10-13  north

In [39]:
df2 = df2[df2['product'].str.contains('pink morsel')==True]
df2['price'] = df2['price'].str.replace('$', '')
df2['price'] = df2['price'].astype(float)
df2['sales'] = df2['price'] * df2['quantity']
cols = ['sales','date','region']

df2 = df2[cols]

C:\Users\hamza\AppData\Local\Temp\ipykernel_6608\2295658945.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df2['price'] = df2['price'].str.replace('$', '')

In [40]:
df2.head()

     sales        date region
0   1578.0  2020-10-13  north
1   1638.0  2020-10-13  south
2   1515.0  2020-10-13   east
3   1683.0  2020-10-13   west
28  1680.0  2020-10-14  north

In [41]:
df2.to_csv(r'./data/processedDF2', index = False)